Autodesk.Navisworks.Api.Plugins.Plugin
Base class for all plugins

Autodesk.Navisworks.Api.Plugins.Plugin.#ctor
Default constructor for a Plugin

Autodesk.Navisworks.Api.Plugins.Plugin.DeveloperId
The 4 character ADN developer code or a GUID. The combination of this and Name should make the plugin unique

Autodesk.Navisworks.Api.Plugins.Plugin.GetString(System.String)
Looks up a localizable string that is specific to this plugin
name:
The identifier of the string to lookup
Returns:
Returns localized string
Throws System.ArgumentNullException:
The identifier is Null.
Throws System.ArgumentException:
Failed to look up string with specified identifier

Autodesk.Navisworks.Api.Plugins.Plugin.GetStringSafe(System.String)
Looks up a localizable string that is specific to this plugin
name:
The identifier of the string to lookup
Returns:
Returns localized string or value of 'name' if it cannot be found
Throws System.ArgumentNullException:
The identifier is Null.

Autodesk.Navisworks.Api.Plugins.Plugin.Id
The full identifier for the plugin. This is formed as
Name.DeveloperId

Autodesk.Navisworks.Api.Plugins.Plugin.IsSelfEnabled
Called once to determines if the plugin is enabled.
Only called if PluginRecord.SupportsIsSelfEnabled is true

Autodesk.Navisworks.Api.Plugins.Plugin.Name
The name of the Plugin. The combination of this and DeveloperId should make the plugin unique

Autodesk.Navisworks.Api.Plugins.Plugin.OnLoaded
Called once immediately after the plugin has been loaded (created).
Plugins are loaded on demand so this may be some time after application startup.
Default implementation does nothing.
This is a good place to subscribe to API events.

Autodesk.Navisworks.Api.Plugins.Plugin.OnUnloading
Called once just before the plugin is unloaded. If the plugin implements
IDisposable, then
Dispose will be called immediately after the plugin is unloaded.
Plugins are typically unloaded at application shutdown or when the end user has disabled a plugin.
Default implementation does nothing.
This is a good place to unsubscribe from API events.

Autodesk.Navisworks.Api.Plugins.Plugin.PluginRecord
The PluginRecord that provides access to the attribute defined properties for this plugin.

Autodesk.Navisworks.Api.Plugins.Plugin.TryGetString(System.String)
Looks up a localizable string that is specific to this plugin
name:
The identifier of the string to lookup
Returns:
Returns localized string or Null if it cannot be found
Throws System.ArgumentNullException:
The identifier is Null.